---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateFaces
source: html/12b45b51-6a3b-3437-1fe9-a98a1a6f3c95.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotGenerateFaces Property

Couldn't generate surfaces for stairs.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotGenerateFaces { get; }
```